Repository: BravoBaldo/Translations
Catalog: LVGL/LVGL_TradIta/LVGL_TradIta-omegat.tmx
Source language: en_us
Languages: it_it

source: `Demo repository <https://github.com/lvgl/lv_port_renesas_ek_ra8p1>`__
it_it: `Repository demo <https://github.com/lvgl/lv_port_renesas_ek_ra8p1>`__

source: `Demo repository <https://github.com/lvgl/lv_port_renesas_rx72n-envision-kit>`__
it_it: `Repository demo <https://github.com/lvgl/lv_port_renesas_rx72n-envision-kit>`__

source: `Demo repository <https://github.com/lvgl/lv_port_renesas_rz-g2l-evkit>`__
it_it: `Repository demo <https://github.com/lvgl/lv_port_renesas_rz-g2l-evkit>`__

source: `Demo repository <https://github.com/lvgl/lv_port_renesas_rz-g2ul-evkit>`__
it_it: `Repository demo <https://github.com/lvgl/lv_port_renesas_rz-g2ul-evkit>`__

source: `Demo repository <https://github.com/lvgl/lv_port_renesas_rz-g3e-evkit>`__
it_it: `Deposito demo <https://github.com/lvgl/lv_port_renesas_rz-g3e-evkit>`__

source: `Download an SDK for a supported board <https://www.nxp.com/design/software/embedded-software/littlevgl-open-source-graphics-library:LITTLEVGL-OPEN-SOURCE-GRAPHICS-LIBRARY?&tid=vanLITTLEVGL-OPEN-SOURCE-GRAPHICS-LIBRARY>`__ today and get started with your next GUI application.
it_it: `Scaricare un SDK per una board supportata <https://www.nxp.com/design/software/embedded-software/littlevgl-open-source-graphics-library:LITTLEVGL-OPEN-SOURCE-GRAPHICS-LIBRARY?&tid=vanLITTLEVGL-OPEN-SOURCE-GRAPHICS-LIBRARY>`__ e iniziare a sviluppare la prossima applicazione GUI.

source: `Emscripten <https://emscripten.org/>`__ can compile C source files into a single HTML output that runs in a browser.
it_it: `Emscripten <https://emscripten.org/>`__ può compilare file sorgenti C in un singolo output HTML che viene eseguito in un browser.

source: `Figma <https://www.figma.com/>`__ integration to easily reimplement Figma designs
it_it: Integrazione con `Figma <https://www.figma.com/>`__ per reimplementare facilmente i design Figma

source: `FreeType tutorial <https://www.freetype.org/freetype2/docs/tutorial/step1.html>`__
it_it: `Tutorial su FreeType <https://www.freetype.org/freetype2/docs/tutorial/step1.html>`__

source: `How to Use LVGL with RT-Thread Studio in STM32F469 Discovery Board <https://www.youtube.com/watch?v=O_QA99BxnOE>`__
it_it: `Come usare LVGL con RT-Thread Studio nella board STM32F469 Discovery <https://www.youtube.com/watch?v=O_QA99BxnOE>`__

source: `How to import a BSP project with latest code into RT-Thread Studio <https://www.youtube.com/watch?v=fREPLuh-h8k>`__
it_it: `Come importare un progetto BSP con il codice più recente in RT-Thread Studio <https://www.youtube.com/watch?v=fREPLuh-h8k>`__

source: `In the Blog <https://blog.lvgl.io/2019-02-20/micropython-bindings#i-need-to-allocate-a-littlevgl-struct-such-as-style-color-etc-how-can-i-do-that-how-do-i-allocatedeallocate-memory-for-it>`__
it_it: `Nel Blog <https://blog.lvgl.io/2019-02-20/micropython-bindings#i-need-to-allocate-a-littlevgl-struct-such-as-style-color-etc-how-can-i-do-that-how-do-i-allocatedeallocate-memory-for-it>`__

source: `In the README <https://github.com/lvgl/lv_binding_micropython#memory-management>`__
it_it: `Nel README <https://github.com/lvgl/lv_binding_micropython#memory-management>`__

source: `Introduce about RT-Thread and how to run LVGL on RT-Thread in simulators <https://www.youtube.com/watch?v=k7QYk6hSwnc>`__
it_it: `Introduzione a RT-Thread e a come eseguire LVGL su RT-Thread nei simulatori <https://www.youtube.com/watch?v=k7QYk6hSwnc>`__

source: `JS Bundle build Notes <https://github.com/lvgl/lv_binding_js/blob/master/doc/build/js-bundle.md>`__
it_it: `Note di build del bundle JS <https://github.com/lvgl/lv_binding_js/blob/master/doc/build/js-bundle.md>`__

source: `LVGL Linux port <https://github.com/lvgl/lv_port_linux/>`__ serves as a reference project for setting up wayland.
it_it: `LVGL Linux port <https://github.com/lvgl/lv_port_linux/>`__ funge da progetto di riferimento per la configurazione di Wayland.

source: `LV_ALIGN_DEFAULT` means `LV_ALIGN_TOP_LEFT` with LTR base direction and `LV_ALIGN_TOP_RIGHT` with RTL base direction.
it_it: `LV_ALIGN_DEFAULT` significa `LV_ALIGN_TOP_LEFT` con direzione di base LTR e `LV_ALIGN_TOP_RIGHT` con direzione di base RTL.

source: `LV_BLUR_QUALITY_PRECISION` will force using higher quality but slower blur.
it_it: `LV_BLUR_QUALITY_PRECISION` forzerà l'uso di una qualità più elevata ma una sfocatura più lenta.

source: `LV_TEXT_ALIGN_AUTO` detect the text base direction and uses left or right alignment accordingly
it_it: `LV_TEXT_ALIGN_AUTO` rileva la direzione di base del testo e utilizza l'allineamento a sinistra o a destra di conseguenza.

source: `Learn More <https://docs.lvgl.io/master/integration/chip_vendors/arm/overview.html#neon-acceleration>`__.
it_it: `Ulteriori informazioni su <https://docs.lvgl.io/master/integration/chip_vendors/arm/overview.html#neon-acceleration>`__.

source: `Learn More <https://docs.lvgl.io/master/integration/chip_vendors/nxp/vg_lite_gpu.html>`
it_it: `Ulteriori informazioni su <https://docs.lvgl.io/master/integration/chip_vendors/nxp/vg_lite_gpu.html>`

source: `Learn More <https://docs.lvgl.io/master/integration/chip_vendors/renesas/built_in_drivers.html#dave2d>`
it_it: `Ulteriori informazioni su <https://docs.lvgl.io/master/integration/chip_vendors/renesas/built_in_drivers.html#dave2d>`

source: `Learn More <https://docs.lvgl.io/master/integration/chip_vendors/stm32/neochrom.html#vector-graphics>`__.
it_it: `Scoprire di Più <https://docs.lvgl.io/master/integration/chip_vendors/stm32/neochrom.html#vector-graphics>`__.

source: `Learn More <https://docs.lvgl.io/master/integration/external_display_controllers/eve/gpu.html>`__.
it_it: `Scoprire di Più <https://docs.lvgl.io/master/integration/external_display_controllers/eve/gpu.html>`__.

source: `Learn More <https://docs.lvgl.io/master/libs/frogfs.html>`__.
it_it: `Ulteriori informazioni su <https://docs.lvgl.io/master/libs/frogfs.html>`__.

source: `Learn More <https://docs.lvgl.io/master/libs/gif.html>`__.
it_it: `Ulteriori informazioni su <https://docs.lvgl.io/master/libs/gif.html>`__.

source: `Learn More <https://pro.lvgl.io/>__`
it_it: `Per Scoprire di Più <https://pro.lvgl.io/>__`

source: `Learn more <https://docs.lvgl.io/master/integration/embedded_linux/drivers/drm.html>`__.
it_it: `Ulteriori informazioni su <https://docs.lvgl.io/master/integration/embedded_linux/drivers/drm.html>`__.

source: `Learn more <https://docs.lvgl.io/master/libs/gltf.html>`__.
it_it: `Scoprire di più <https://docs.lvgl.io/master/libs/gltf.html>`__.

source: `Learn more <https://docs.lvgl.io/master/libs/gstreamer.html>`__.
it_it: `Altre informazioni <https://docs.lvgl.io/master/libs/gstreamer.html>`__.

source: `MIPI Alliance <https://www.mipi.org/>`__ is a global business alliance that develops technical specifications for the mobile ecosystem, particularly smart phones but including mobile-influenced industries.
it_it: `MIPI Alliance <https://www.mipi.org/>`__ è un'alleanza commerciale globale che sviluppa specifiche tecniche per l'ecosistema mobile, in particolare per gli smartphone, ma include anche i settori influenzati dalla tecnologia mobile.

source: `MicroPython <http://micropython.org/>`__ is Python for microcontrollers.
it_it: `MicroPython <http://micropython.org/>`__ è Python per microcontrollori.

source: `NuttX <https://nuttx.apache.org/>`__ is a mature and secure real-time operating system (RTOS) with an emphasis on technical standards compliance and small size.
it_it: `NuttX <https://nuttx.apache.org/>`__ è un sistema operativo real-time (RTOS) maturo e sicuro, con particolare attenzione alla conformità agli standard tecnici e alle dimensioni ridotte.

source: `PikaScript <https://github.com/pikasTech/pikascript>`__ is a Python interpreter designed specifically for microcontrollers, and it supports a subset of the common Python3 syntax.
it_it: `PikaScript <https://github.com/pikasTech/pikascript>`__ è un interprete Python progettato specificamente per microcontrollori e supporta un sottoinsieme della comune sintassi Python3.

source: `PlatformIO <https://platformio.org/>`__ is an open-source ecosystem for embedded development that integrates with VS Code and supports many boards and frameworks.
it_it: `PlatformIO <https://platformio.org/>`__ è un ecosistema open source per lo sviluppo embedded che si integra con VS Code e supporta numerose schede e framework.

source: `QEMU simulator <https://github.com/RT-Thread/rt-thread/tree/master/bsp/qemu-vexpress-a9/applications/lvgl>`__
it_it: `Simulatore QEMU <https://github.com/RT-Thread/rt-thread/tree/master/bsp/qemu-vexpress-a9/applications/lvgl>`__

source: `QuickJS <https://bellard.org/quickjs/>`__: JavaScript engine
it_it: `QuickJS <https://bellard.org/quickjs/>`__: Motore JavaScript

source: `RT-Thread <https://www.rt-thread.io/>`__ is an `open source <https://github.com/RT-Thread/rt-thread>`__, neutral, and community-based real-time operating system (RTOS).
it_it: `RT-Thread <https://www.rt-thread.io/>`__ è un sistema operativo real-time (RTOS) `open source <https://github.com/RT-Thread/rt-thread>`__, neutrale e basato sulla community.

source: `RT-Thread Youtube Channel <https://www.youtube.com/channel/UCdDHtIfSYPq4002r27ffqPw>`__
it_it: `Canale YouTube di RT-Thread <https://www.youtube.com/channel/UCdDHtIfSYPq4002r27ffqPw>`__

source: `RT-Thread documentation center <https://www.rt-thread.io/document/site/>`__
it_it: `Centro di documentazione di RT-Thread <https://www.rt-thread.io/document/site/>`__

source: `Renesas <https://renesas.com/>`__ is an official partner of LVGL.
it_it: `Renesas <https://renesas.com/>`__ è un partner ufficiale di LVGL.

source: `Riverdi <https://riverdi.com/>`__ specializes in making high quality displays and the boards that carry them.
it_it: `Riverdi <https://riverdi.com/>`__ è specializzata nella produzione di display di alta qualità e delle relative schede.

source: `SDL <https://www.libsdl.org/>`__ (Simple DirectMedia Layer) provides a cross-platform way to handle graphics, input, and multimedia, making it an excellent choice for running LVGL applications on a PC.
it_it: `SDL <https://www.libsdl.org/>`__ (Simple DirectMedia Layer) offre un modo multipiattaforma per gestire grafica, input e contenuti multimediali, rendendolo una scelta eccellente per l'esecuzione di applicazioni LVGL su PC.

source: `STM32CubeIDE can be downloaded from here.
it_it: `STM32CubeIDE può essere scaricato da qui.

source: `See all plans`_.
it_it: `Confrontare tutti i piani`_.

source: `See here <https://code.visualstudio.com/docs/setup/setup-overview>`__.
it_it: `Vedere qui <https://code.visualstudio.com/docs/setup/setup-overview>`__.

source: `See here <https://github.com/RudolphRiedel/FT800-FT813/blob/ee35fa45c37aed78dc4f1196b874ee1c8f80429f/EVE_config.h#L856-L872>`__.
it_it: `Vedere qui <https://github.com/RudolphRiedel/FT800-FT813/blob/ee35fa45c37aed78dc4f1196b874ee1c8f80429f/EVE_config.h#L856-L872>`__.

source: `Tasmota <https://github.com/arendst/Tasmota>`__ is a widely used open-source firmware for ESP8266 and ESP32 based devices.
it_it: `Tasmota <https://github.com/arendst/Tasmota>`__ è un firmware open source ampiamente utilizzato per dispositivi basati su ESP8266 e ESP32.

source: `Tasmota Documentation <https://tasmota.github.io/docs/>`__
it_it: `Documentazione di Tasmota <https://tasmota.github.io/docs/>`__

source: `Tasmota LVGL Berry documentation <https://tasmota.github.io/docs/LVGL/>`__
it_it: `Documentazione di Berry per Tasmota LVGL <https://tasmota.github.io/docs/LVGL/>`__

source: `The TSC converter can be downloaded from here.
it_it: `Il convertitore TSC può essere scaricato qui.

source: `The yocto project layer model <https://docs.yoctoproject.org/ overview-manual/yp-intro.html#the-yocto-project-layer-model>`_ facilitates collaboration, sharing, customization, and reuse within the Yocto Project development environment.
it_it: `Il modello a layer del progetto Yocto <https://docs.yoctoproject.org/ overview-manual/yp-intro.html#the-yocto-project-layer-model>`_ facilita la collaborazione, la condivisione, la personalizzazione e il riutilizzo all'interno dell'ambiente di sviluppo Yocto Project.

source: `Verdin Development Board with HDMI Adapter <https://www.toradex.com/ products/carrier-board/verdin-development-board-kit>`_
it_it: `Verdin Development Board con HDMI Adapter <https://www.toradex.com/ products/carrier-board/verdin-development-board-kit>`_

source: `Viewe <https://viewedisplay.com/>`__ specializes in comprehensive display solutions for more than 10 Years with remarkable capability of software and hardware R&D, factory manufacturing and sales service.
it_it: `Viewe <https://viewedisplay.com/>`__ è specializzata in soluzioni di visualizzazione complete da oltre 10 anni, con una notevole capacità di ricerca e sviluppo software e hardware, produzione in fabbrica e assistenza commerciale.

source: `Visual Studio <https://visualstudio.microsoft.com/>`__ is a comprehensive IDE from Microsoft containing all the tools required for development out of the box.
it_it: `Visual Studio <https://visualstudio.microsoft.com/>`__ è un IDE completo di Microsoft che contiene tutti gli strumenti necessari per lo sviluppo pronti all'uso.

source: `Visual Studio simulator <https://github.com/RT-Thread/rt-thread/tree/master/bsp/simulator/applications/lvgl>`__
it_it: `Simulatore di Visual Studio <https://github.com/RT-Thread/rt-thread/tree/master/bsp/simulator/applications/lvgl>`__

source: `Zephyr <https://zephyrproject.org/>`__ is an `open source <https://github.com/zephyrproject-rtos/zephyr>`__ real-time operating system (RTOS) that is easy to deploy, secure, connect and manage.
it_it: `Zephyr <https://zephyrproject.org/>`__ è un sistema operativo real-time (RTOS) `open source <https://github.com/zephyrproject-rtos/zephyr>`__ facile da implementare, proteggere, connettere e gestire.

source: `_g2d_delete()` will cleanup the G2D draw unit.
it_it: `_g2d_delete()` pulirà l'unità di disegno G2D.

source: `_g2d_dispatch()` is the G2D dispatcher callback, it will take a ready to draw task (having the `DRAW_UNIT_ID_G2D` set) and will pass the task to the G2D draw unit for processing.
it_it: `_g2d_dispatch()` è la callback del dispatcher G2D, che prenderà un'attività pronta per essere disegnata (con `DRAW_UNIT_ID_G2D` impostato) e la passerà all'unità di disegno G2D per l'elaborazione.

source: `_g2d_evaluate()` will get called after each task is being created and will analyze if the task is supported by G2D or not.
it_it: `_g2d_evaluate()` verrà chiamato dopo la creazione di ogni task e analizzerà se questa è supportata da G2D o meno.

source: `_pxp_delete()` will cleanup the PXP draw unit.
it_it: `_pxp_delete()` ripulisce l'unità di disegno PXP.

source: `_pxp_dispatch()` is the PXP dispatcher callback, it will take a ready to draw task (having the `DRAW_UNIT_ID_PXP` set) and will pass the task to the PXP draw unit for processing.
it_it: `_pxp_dispatch()` è la callback del dispatcher PXP, che accetta un task pronto per il disegno (con `DRAW_UNIT_ID_PXP` impostato) e la passa all'unità di disegno PXP per l'elaborazione.

source: `_pxp_evaluate()` will get called after each task is being created and will analyze if the task is supported by PXP or not.
it_it: `_pxp_evaluate()` verrà chiamato dopo la creazione di ogni task e analizzerà se questa è supportata da PXP o meno.

source: `_vglite_delete()` will cleanup the VGLite draw unit.
it_it: `_vglite_delete()` pulirà l'unità di disegno VGLite.

source: `_vglite_dispatch()` is the VGLite dispatcher callback, it will take a ready to draw task (having the `DRAW_UNIT_ID_VGLITE` set) and will pass the task to the VGLite draw unit for processing.
it_it: `_vglite_dispatch()` è la callback del dispatcher VGLite, che accetta un task pronto per il disegno (con `DRAW_UNIT_ID_VGLITE` impostato) e la passa all'unità di disegno VGLite per l'elaborazione.

source: `_vglite_evaluate()` will get called after each task is being created and will analyze if the task is supported by VGLite or not.
it_it: `_vglite_evaluate()` verrà chiamato dopo la creazione di ogni task e analizzerà se questa è supportata da VGLite o meno.

source: ``"1#"`` Load number map.
it_it: ``"1#"`` Carica la mappa dei numeri.

source: ``"ABC"`` Load upper-case map.
it_it: ``"ABC"`` Carica la mappa delle maiuscole.

source: ``"abc"`` Load lower-case map.
it_it: ``"abc"`` Carica la mappa delle minuscole.

source: ``"arg"``: Describes a function argument
it_it: ``"arg"``: Descrive un argomento di funzione.

source: ``"args"``: array of ``"arg"`` json types.
it_it: ``"args"``: array of ``"arg"`` tipi json.

source: ``"args"``: array of ``"arg"`` objects described above
it_it: ``"args"``: array degli oggetti ``"arg"`` descritti sopra

source: ``"array"``: The array type is used to identify arrays.
it_it: ``"array"``: Il tipo dell'array viene utilizzato per identificare gli array.

source: ``"bitsize"``: The number of bits for bit-fields, or ``null`` for normal field types.
it_it: ``"bitsize"``: Numero di bit per i campi bit, o ``null`` per i tipi di campo normali.

source: ``"dim"``: number of items in array
it_it: ``"dim"``: numero di elementi nell'array

source: ``"docstring"``: string containing Doxygen-extracted documentation
it_it: ``"docstring"``: stringa contenente la documentazione estratta da Doxygen.

source: ``"enum"``: C enumerations
it_it: ``"enum"``: Enumerazioni C

source: ``"enum_member"``: enumerator (enumeration value).
it_it: ``"enum_member"``: enumeratore (valore di enumerazione).

source: ``"field"``: This type is used to describe fields in structures and unions.
it_it: ``"field"``: Questo tipo viene utilizzato per descrivere i campi in strutture e unioni.

source: ``"fields"``: array of ``"field"`` elements.
it_it: ``"fields"``: array di elementi ``"field"``.

source: ``"fields"``: array of ``"field"`` objects (See definition above.)
it_it: ``"fields"``: array di oggetti ``"field"`` (Vedere la definizione sopra).

source: ``"forward_decl"``: Describes a forward declaration.
it_it: ``"forward_decl"``: Descrive una dichiarazione in avanti (forward).

source: ``"function"``: C function
it_it: ``"function"``: funzione C

source: ``"function_pointer"``: Describes a function pointer.
it_it: ``"function_pointer"``: Descrive un puntatore a funzione.

source: ``"json_type"`` carries object type (e.g. "enum", "function", etc.) identifying the top-level group it comes from
it_it: ``"json_type"`` trasporta il tipo di oggetto (ad esempio "enum", "function", ecc.) che identifica il gruppo di livello superiore da cui proviene

source: ``"json_type"`` carries object type (e.g. "enum", "function", etc.) identifying the top-level group it comes from.
it_it: ``"json_type"`` trasporta il tipo di oggetto (ad esempio "enum", "function", ecc.) che identifica il gruppo di livello superiore da cui proviene.

source: ``"lvgl_type"``: Data type defined in LVGL (begins with ``"lv_"`` and ends with ``"_t"``.
it_it: ``"lvgl_type"``: Tipo di dati definito in LVGL (inizia con ``"lv_"`` e termina con ``"_t"``.

source: ``"macro"``: C macro.
it_it: ``"macro"``: macro C.

source: ``"members"``: array of ``"enum_member"`` objects
it_it: ``"members"``: array di oggetti ``"enum_member"``

source: ``"name"``: If enumeration is the result of a ``typedef``, this field carries the type name defined.
it_it: ``"name"``: Se l'enumerazione è il risultato di un ``typedef``, questo campo riporta il nome del tipo definito.

source: ``"name"``: always "ellipsis"
it_it: ``"name"``: sempre "ellissi" (``...``)

source: ``"name"``: argument name
it_it: ``"name"``: nome dell'argomento

source: ``"name"``: enumerator name
it_it: ``"name"``: nome dell'enumeratore

source: ``"name"``: field name
it_it: ``"name"``: nome del campo

source: ``"name"``: function name
it_it: ``"name"``: nome della funzione

source: ``"name"``: macro name
it_it: ``"name"``: nome della macro

source: ``"name"``: name of data type
it_it: ``"name"``: nome del tipo di dati

source: ``"name"``: name of forward declaration
it_it: ``"name"``: nome della dichiarazione forward

source: ``"name"``: name of function pointer
it_it: ``"name"``: nome del puntatore a funzione

source: ``"name"``: name of primitive type
it_it: ``"name"``: nome del tipo primitivo

source: ``"name"``: struct name (data type if defined by ``typedef``)
it_it: ``"name"``: nome della struct (tipo di dati se definito da ``typedef``)

source: ``"name"``: type name
it_it: ``"name"``: nome del tipo

source: ``"name"``: type name (e.g. ``lv_part_t``)
it_it: ``"name"``: nome del tipo (ad esempio ``lv_part_t``)

source: ``"name"``: union name (data type if defined by ``typedef``)
it_it: ``"name"``: nome della union (tipo di dati se definito da ``typedef``)

source: ``"name"``: variable name
it_it: ``"name"``: nome della variabile

source: ``"pointer"``: C pointer
it_it: ``"pointer"``: puntatore C

source: ``"primitive_type"``: Data type that does not begin with ``"lv_"`` and end with ``"_t"``.
it_it: ``"primitive_type"``: Tipo di dati che non inizia con ``"lv_"`` e non termina con ``"_t"``.

source: ``"quals"``: array of any qualifiers present, e.g. "const"
it_it: ``"quals"``: array di tutti i qualificatori presenti, ad esempio "const"

source: ``"quals"``: array of qualifiers, IE "const"
it_it: ``"quals"``: array di qualificatori, ad esempio, "const"

source: ``"ret_type"``: return type from a function.
it_it: ``"ret_type"``: tipo di ritorno da una funzione.

source: ``"special_type"``: Currently only used to describe an ellipsis argument of a function.
it_it: ``"special_type"``: Attualmente utilizzato solo per descrivere un argomento con ellissi (``...``) di una funzione.

source: ``"stdlib_type"``: C type (name of type comes from one of the ``std*.h`` header files)
it_it: ``"stdlib_type"``: tipo C (il nome del tipo deriva da uno dei file header ``std*.h``)

source: ``"storage"``: array of any storage-class specifiers present (e.g. "auto", "static", "extern", etc.)
it_it: ``"storage"``: array di tutti gli specificatori di classe di archiviazione presenti (ad esempio "auto", "static", "extern", ecc.)

source: ``"struct"``: C struct
it_it: ``"struct"``: struct C

source: ``"type"``: A "ret_type" object.
it_it: ``"type"``: Un oggetto "ret_type".

source: ``"type"``: If enumeration is the result of a ``typedef``, this field carries the type name defined.
it_it: ``"type"``: Se l'enumerazione è il risultato di un ``typedef``, questo campo contiene il nome del tipo definito.

source: ``"type"``: This may or may not be available.
it_it: ``"type"``: Questo potrebbe essere disponibile o meno.

source: ``"type"``: a "primitive_type" object {"name": "struct", "json_type": "primitive_type"}.
it_it: ``"type"``: un oggetto "primitive_type" object {"name": "struct", "json_type": "primitive_type"}.

source: ``"type"``: a "primitive_type" object {"name": "uint32_t", "json_type": "stdlib_type"}.
it_it: ``"type"``: un oggetto "primitive_type" {"name": "uint32_t", "json_type": "stdlib_type"}.

source: ``"type"``: a "primitive_type" object {"name": "union", "json_type": "primitive_type"}.
it_it: ``"type"``: un oggetto "primitive_type" {"name": "union", "json_type": "primitive_type"}.

source: ``"type"``: data type
it_it: ``"type"``: tipo di dato

source: ``"type"``: function return type
it_it: ``"type"``: tipo di ritorno della funzione

source: ``"type"``: pointer type
it_it: ``"type"``: tipo puntatore

source: ``"type"``: type of enumerators (always "int")
it_it: ``"type"``: tipo di enumeratori (sempre "int")

source: ``"typedef"``: C type definition
it_it: ``"typedef"``: definizione del tipo C

source: ``"union"``: C union
it_it: ``"union"``: union C

source: ``"unknown_type"``: This should not be seen.
it_it: ``"unknown_type"``: Questo non dovrebbe essere visibile.
